ep03-blockmesh/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM From Scratch — Episode 3 | Meshing with blockMesh                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// This episode only meshes and checks the mesh, so these values are just
// enough to keep OpenFOAM happy. Episode 4 onward will use them for real.

application     icoFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         0.5;

deltaT          0.005;

writeControl    timeStep;
writeInterval   20;

purgeWrite      0;

writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

// ************************************************************************* //
