ep03-blockmesh/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM From Scratch — Episode 3 | Meshing with blockMesh                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Kinematic viscosity. Note the dimensions in square brackets:
// [0 2 -1 0 0 0 0] = m^2/s. OpenFOAM checks these units for you.
nu              [0 2 -1 0 0 0 0] 0.01;

// ************************************************************************* //
