ep03-blockmesh/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM From Scratch — Episode 3 | Meshing with blockMesh                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Velocity. dimensions [0 1 -1 0 0 0 0] = m/s.
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           uniform (1 0 0);   // lid slides at 1 m/s in +x
    }

    fixedWalls
    {
        type            noSlip;            // fluid sticks to the walls
    }

    frontAndBack
    {
        type            empty;             // 2D case
    }
}

// ************************************************************************* //
